numbers = [
    2, 6, 3, 14, 10, 4, 11, 16, 12, 5, 4, 16, 1, 0, 8, 16, 10, 10, 8, 5, 1, 11, 10, 10, 12,
      0, 0, 6, 14, 8, 2, 12, 14, 5, 6, 12, 1, 2, 10, 14, 9, 1, 15, 1, 2, 14, 16, 6, 7, 5
      ]

print(f'\nДлина списка: {len(numbers)}')
print(f'\nПоследний элемент списка: {numbers[-1]}')
print(numbers[::-1])
print('\nYES (5 и 17 в списке)' if  (5, 17) in numbers else '\nNO - (5 и 17 нет в списке)')
numbers.pop(); numbers.pop(0)
print(f'\nсписок с удалёнными первым и последним элементами: {numbers}')